leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5606s_portdefs.h
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 *
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with
 * the terms contained in the written license agreement between you and ArcCore,
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as
 * published by the Free Software Foundation and appearing in the file
 * LICENSE.GPL included in the packaging of this file or here
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/
#ifndef _MPC5606SPORTDEFS_H
#define _MPC5606SPORTDEFS_H


/* Pad: 0*/
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_SOUND PORT_FUNC3
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 1*/
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 2*/
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 3*/
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 4*/
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 5*/
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 6*/
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 7*/
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 8*/
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_I2C PORT_FUNC3
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 9*/
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_I2C PORT_FUNC3
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 10*/
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 11*/
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 12*/
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 13*/
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 14*/
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 15*/
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 16*/
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_PDI PORT_FUNC2

/* Pad: 17*/
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_PDI PORT_FUNC2

/* Pad: 18*/
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_LIN PORT_FUNC1

/* Pad: 19*/
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_LIN PORT_FUNC1

