leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5606s_portdefs.h
/* Pad: 20*/
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_ADC PORT_FUNC2

/* Pad: 21*/
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_ADC PORT_FUNC2
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_CONTROL PORT_FUNC3

/* Pad: 22*/
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_ADC PORT_FUNC2
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_CONTROL PORT_FUNC3

/* Pad: 23*/
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_ICU PORT_FUNC2

/* Pad: 24*/
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_ICU PORT_FUNC2

/* Pad: 25*/
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_ICU PORT_FUNC2

/* Pad: 26*/
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_PDI PORT_FUNC2
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 27*/
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_PDI PORT_FUNC2
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 28*/
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 29*/
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 30*/
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 31*/
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 32*/
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 33*/
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 34*/
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 35*/
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 36*/
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 37*/
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 38*/
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 39*/
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 40*/
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_SGL PORT_FUNC2
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 41*/
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_ADC PORT_FUNC2
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 42*/
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_ADC PORT_FUNC2
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 43*/
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_ADC PORT_FUNC2
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 44*/
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 45*/
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_ADC PORT_GPIO_APC

/* Pad: 46*/
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 47*/
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 48*/
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 49*/
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 50*/
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 51*/
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 52*/
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_ICU PORT_FUNC3

