leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5606s_portdefs.h
/* Pad: 53*/
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 54*/
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_SSD PORT_FUNC2

/* Pad: 55*/
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_SSD PORT_FUNC2

/* Pad: 56*/
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_SSD PORT_FUNC2

/* Pad: 57*/
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_SSD PORT_FUNC2

/* Pad: 58*/
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_SSD PORT_FUNC2

/* Pad: 59*/
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_SSD PORT_FUNC2

/* Pad: 60*/
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_SSD PORT_FUNC2

/* Pad: 61*/
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_SSD PORT_FUNC2

/* Pad: 62*/
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 63*/
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 64*/
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 65*/
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 66*/
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 67*/
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 68*/
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 69*/
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_SMC PORT_FUNC1
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_SSD PORT_FUNC2
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 70*/
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_PDI PORT_FUNC2
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 71*/
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_PDI PORT_FUNC2
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 72*/
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_NMI PORT_FUNC1

/* Pad: 73*/
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_PDI PORT_FUNC2
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 74*/
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_PDI PORT_FUNC2
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 75*/
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_DCU PORT_FUNC2
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_LCD PORT_GPIO_APC

