leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5606s_portdefs.h
/* Pad: 76*/
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_I2C PORT_FUNC1
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 77*/
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_I2C PORT_FUNC1
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 78*/
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_I2C PORT_FUNC1
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_LIN PORT_FUNC3
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 79*/
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_I2C PORT_FUNC1
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_LIN PORT_FUNC3
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 80*/
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 81*/
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 82*/
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 83*/
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 84*/
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 85*/
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 86*/
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_I2C PORT_FUNC2
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_SGL PORT_FUNC3
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 87*/
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_I2C PORT_FUNC2
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 88*/
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 89*/
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 90*/
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 91*/
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 92*/
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 93*/
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_DCU PORT_FUNC1
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 94*/
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_DCU PORT_FUNC1

/* Pad: 95*/
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_DCU PORT_FUNC1

/* Pad: 96*/
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_DCU PORT_FUNC1

/* Pad: 97*/
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_DCU PORT_FUNC1

/* Pad: 98*/
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_SGL PORT_FUNC2
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_LCD PORT_GPIO_APC

/* Pad: 99*/
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_JTAG PORT_FUNC1

/* Pad: 100*/
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_JTAG PORT_FUNC1

/* Pad: 101*/
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_JTAG PORT_FUNC1

