leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5606s_portdefs.h
/* Pad: 102*/
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_JTAG PORT_FUNC1

/* Pad: 103*/
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_CONTROL PORT_FUNC3

/* Pad: 104*/
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_LCD PORT_FUNC1

/* Pad: 105*/
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_PDI PORT_FUNC1

/* Pad: 106*/
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_PDI PORT_FUNC1

/* Pad: 107*/
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_PDI PORT_FUNC1

/* Pad: 108*/
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_PDI PORT_FUNC1

/* Pad: 109*/
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_PDI PORT_FUNC1
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_CAN PORT_FUNC2

/* Pad: 110*/
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_PDI PORT_FUNC1
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_CAN PORT_FUNC2

/* Pad: 111*/
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_PDI PORT_FUNC1
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 112*/
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_PDI PORT_FUNC1
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_ICU PORT_FUNC3

/* Pad: 113*/
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_PDI PORT_FUNC1

/* Pad: 114*/
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_PDI PORT_FUNC1

/* Pad: 115*/
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_PDI PORT_FUNC1

/* Pad: 116*/
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_PDI PORT_FUNC1

/* Pad: 117*/
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_PDI PORT_FUNC1
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_ICU PORT_FUNC2

/* Pad: 118*/
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_PDI PORT_FUNC1
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_ICU PORT_FUNC2

/* Pad: 119*/
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_PDI PORT_FUNC1
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_ICU PORT_FUNC2

/* Pad: 120*/
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_PDI PORT_FUNC1
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_ICU PORT_FUNC2

/* Pad: 121*/
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_PDI PORT_FUNC1
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_DCU PORT_FUNC3

/* Pad: 122*/
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_PDI PORT_FUNC1
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_ICU PORT_FUNC2

/* Pad: 123*/
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_NEXUS PORT_FUNC1
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_PDI PORT_FUNC2

/* Pad: 124*/
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_NEXUS PORT_FUNC1
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_PDI PORT_FUNC2

/* Pad: 125*/
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_NEXUS PORT_FUNC1
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_PDI PORT_FUNC2

/* Pad: 126*/
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_NEXUS PORT_FUNC1
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_PDI PORT_FUNC2

/* Pad: 127*/
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_NEXUS PORT_FUNC1
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_PDI PORT_FUNC2

/* Pad: 128*/
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_NEXUS PORT_FUNC1
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_PDI PORT_FUNC2

/* Pad: 129*/
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_NEXUS PORT_FUNC1
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_PDI PORT_FUNC2

/* Pad: 130*/
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_NEXUS PORT_FUNC1
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_PDI PORT_FUNC2

/* Pad: 131*/
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_I2C PORT_FUNC1
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_ICU PORT_FUNC2

/* Pad: 132*/
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_I2C PORT_FUNC1
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_ICU PORT_FUNC2

/* Input mux selection */
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_17{0, 0}
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_109{0, 1}

#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_26{1, 0}
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_83{1, 1}
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_111{1, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_17{2, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_109{2, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_16{3, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_110{3, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_26{4, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_111{4, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_27{5, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_112{5, 1}

