leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5606s_portdefs.h
#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_70{6, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_113{6, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_71{7, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_114{7, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_73{8, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_115{8, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_74{9, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_116{9, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_119{10, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_123{10, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_120{11, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_124{11, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_121{12, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_125{12, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_122{13, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PDI_PAD_126{13, 1}

#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_43{14, 0}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_79{14, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_69{15, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_91{15, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_98{15, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_15{16, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_68{16, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_75{16, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_14{17, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_67{17, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_74{17, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_13{18, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_66{18, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_73{18, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_12{19, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_65{19, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_71{19, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_11{20, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_64{20, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_70{20, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_63{21, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_132{21, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_6{22, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_62{22, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_131{22, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_7{23, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_27{23, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_80{23, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_5{24, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_122{24, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_4{25, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_121{25, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_3{26, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_120{26, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_2{27, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_119{27, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_1{28, 0}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_71{28, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_112{28, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_0{29, 0}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_70{29, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_111{29, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_26{30, 0}
#define INPUT_SELECT_PORT_PIN_MODE_OTHER_PAD_98{30, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_53{31, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_82{31, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_103{31, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_52{32, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_90{32, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_117{32, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_9{33, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_29{33, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_51{33, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_28{34, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_50{34, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_88{34, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_10{35, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_25{35, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_49{35, 2}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_118{35, 3}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_24{36, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_48{36, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_89{36, 2}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_23{37, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_47{37, 1}

#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_8{38, 0}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_46{38, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_81{38, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_69{15, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_91{15, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_98{15, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_15{16, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_68{16, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_75{16, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_14{17, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_67{17, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_74{17, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_13{18, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_66{18, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_73{18, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_12{19, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_65{19, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_71{19, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_11{20, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_64{20, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_70{20, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_63{21, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_132{21, 1}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_6{22, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_62{22, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_131{22, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_7{23, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_27{23, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_80{23, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_5{24, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_122{24, 1}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_4{25, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_121{25, 1}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_3{26, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_120{26, 1}

