leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5606s_portdefs.h
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_2{27, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_119{27, 1}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_1{28, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_112{28, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_0{29, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_111{29, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_26{30, 0}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_53{31, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_82{31, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_103{31, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_52{32, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_90{32, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_117{32, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_9{33, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_29{33, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_51{33, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_28{34, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_50{34, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_88{34, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_10{35, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_25{35, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_49{35, 2}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_118{35, 3}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_24{36, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_48{36, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_89{36, 2}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_23{37, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_47{37, 1}

#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_8{38, 0}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_46{38, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_81{38, 2}

#define INPUT_SELECT_PORT_PIN_MODE_I2C_PAD_79{39, 0}
#define INPUT_SELECT_PORT_PIN_MODE_I2C_PAD_132{39, 1}

#define INPUT_SELECT_PORT_PIN_MODE_I2C_PAD_78{40, 0}
#define INPUT_SELECT_PORT_PIN_MODE_I2C_PAD_131{40, 1}

#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_28{41, 0}
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_78{41, 1}

#define INPUT_SELECT_PORT_PIN_MODE_NEXUS_PAD_126{42, 0}

#endif  /* _MPC5606SPORTDEFS_H*/
